[
  "\n",
  {
    "name": "header",
    "props": {
      "level": 3
    },
    "children": [
      "Идея схемы"
    ]
  },
  "\nРешил попрактиковаться в создании научно-популярных иллюстраций.\nВсегда считал, что не было нормальных схем переливания относительно стандартных четырёх групп и резус-фактора.\nТе схемы, что я видел в интернете, кажется рисовали на коленке за полчаса.\n\n\nВ итоге я совместил все зависимости групп и резус-фактора на одной схеме и добавил переливание плазмы.\n\n\nПосмотреть можно в разделе ",
  {
    "name": "link",
    "props": {
      "href": "/?/projects/blood-types"
    },
    "children": [
      "Группы крови"
    ]
  },
  ".\nСхема представлена в светлой и тёмной версии.\nПолностью доступна для скачивания (",
  {
    "name": "format.pre",
    "props": {},
    "children": [
      "svg/pdf/png"
    ]
  },
  ") и использования.\n\n",
  {
    "name": "image",
    "props": {
      "width": 1,
      "height": 1,
      "src": "/data/images/schemes/blood-types/light.svg"
    },
    "children": [
      "Светлая версия"
    ]
  },
  "\n\n\n",
  {
    "name": "header",
    "props": {
      "level": 3
    },
    "children": [
      "Процесс"
    ]
  },
  "\nРисовал в векторном формате в редакторе Inkscape.\nПереливание без учёта резус-фактора представляет собой схематический ромб.\n",
  {
    "name": "code",
    "props": {},
    "children": [
      "\n /--> A ---v\n0 -------> AB\n \\--> B ---^\n"
    ]
  },
  "\nОн и приводится в большинстве схем.\n\n\nЧтобы избежать пересечений линий переливания, я поместил положительный резус внутрь отрицательного, так как положительный можно переливать только к положительному.\nСтрелки от отрицательного резуса идут параллельно стрелкам от положительного, и пересечений не возникает.\nВнутри группы устройство концентрических окружностей пояснено снизу, принцип такой же — отрицательный можно переливать в положительный, но не наоборот.\n\n\nИ конечно, кровь с одинаковой группой и резусом можно переливать \"саму в себя\", так сейчас в больницах и делают, а схему с переливанием разных групп используют только в экстренной ситуации или если нужно перелить совсем немного.\nДополнительно, так как переливание плазмы симметрично, решил добавить плазму к той же схеме.\nЛегко запомнить, ведь для плазмы стрелки идут в обратном направлении.\n\n\nТёмную версию я получил, подобрав цвета для очень тёмного фона.\nОсновные цвета (синий и красный) не изменились.\n\nНа сайте автоматически выбирается версия схемы, исходя из текущей темы сайта.\n\n\n",
  {
    "name": "header",
    "props": {
      "level": 3
    },
    "children": [
      "Перспективы"
    ]
  },
  "\nЯ рисовал всё вручную, но конечно хочется добиться того же эффекта для автоматической генерации.\nТогда можно будет легко сделать схему интерактивной, подсвечивать процесс переливания например, и даже его анимировать.\n"
]