[
  "\nКаждое изменение небольшое, поэтому написал о них всех сразу.\n\n\n",
  {
    "name": "header",
    "props": {
      "level": 3
    },
    "children": [
      "Изменение интерфейса"
    ]
  },
  "\nПрежде всего была добавлена функциональность на главную страницу с блогом.\nТеперь можно фильтровать статьи по тегам.\nПри клике на тег он становится активным и все статьи, содержащие его, попадают в выборку.\nТеги кликабельны как и под заголовками, так и на верхней панели.\nПанель прокручивается горизонтально.\nСбросить выбранные теги и показать все статьи можно, нажав на специальный псевдо-тег ",
  {
    "name": "format.i",
    "props": {},
    "children": [
      "all"
    ]
  },
  ".\n\nУбрал кнопки ",
  {
    "name": "format.b",
    "props": {},
    "children": [
      "Читать"
    ]
  },
  ", теперь весь заголовок это ссылка на статью.\n\n\nДобавил в порядке эксперимента мини-логотипы для ссылок.\nПока для ",
  {
    "name": "link",
    "props": {
      "href": "https://wikipedia.org"
    },
    "children": [
      "википедии"
    ]
  },
  " и ",
  {
    "name": "link",
    "props": {
      "href": "https://github.com"
    },
    "children": [
      "гитхаба"
    ]
  },
  ".\nДля этого скачал их в векторном формате и вручную уменьшил размер, округляя координаты точек для кривых Безье.\n\n\nЗаодно под капотом проделал работу по выделению общих компонентов для страниц, теперь страницы стали выглядеть в одном стиле(Проекты, Физика, Дизайн).\n\n\n",
  {
    "name": "header",
    "props": {
      "level": 3
    },
    "children": [
      "Новые разделы"
    ]
  },
  "\nДавно уже есть темы, но решил завести для них ",
  {
    "name": "link",
    "props": {
      "href": "?/design/themes"
    },
    "children": [
      "отдельную страничку"
    ]
  },
  " в разделе ",
  {
    "name": "link",
    "props": {
      "href": "?/design"
    },
    "children": [
      "дизайна"
    ]
  },
  ".\nСравниваются тёмная и светлая темы для одинакового контента.\n\n\nСоздан раздел ",
  {
    "name": "link",
    "props": {
      "href": "?/catalog"
    },
    "children": [
      "Каталог"
    ]
  },
  ".\nТуда я буду помещать интересные и полезные мне ссылки.\nПока он выглядит просто, всего лишь дерево со ссылками листьями.\nТроеточие в дереве означает лишь то, что я ещё не определил ссылку в категорию.\n\nВ будущем помимо заполнения ссылками планирую сделать поиск и удобную организацию ссылок.\nВозможно подумаю в сторону автоматического вытаскивания иконки сайта(.ico) и её кэшировании.\n"
]