import { BookApi } from '@bookbox/preset-web';
import { getCustomElements } from '../../elements.js';

export default (api: BookApi) => {
    const { format, start, end, math, label, link, area, list, item } = api;
    const { i, b } = format;

    const {paragraph, theorem, problem, proof, B, n} = getCustomElements(api);

    return api.book`
${paragraph`Трансфинитная индукция и базис Гамеля`}
Вполне упорядоченные множества и ${label.ref('theorem_set-order')`теорема Цермело`} позволяют продолжать индуктивные построения в трансфинитную область (если выражаться торжественно).
Поясним это на примере из линейной алгебры.


Всякое линейно независимое множество векторов в конечномерном пространстве может быть дополнено до базиса.
Как это доказывается?
Пусть ${math`S`} — данное нам линейно независимое множество.
Если оно не является базисом, то некоторый вектор ${math`x_0`} через него не выражается.
Добавим его к ${math`S`}, получим линейно независимое множество ${math`S \\cup \\{x_0\\}`}.
Если и оно не является базисом, то некоторый вектор ${math`x_1`} через него не выражается, и т.д.
Либо на каком-то шаге мы получим базис, либо процесс не оборвётся и мы получим бесконечную последовательность линейно независимых векторов, что противоречит конечномерности.


Теперь с помощью трансфинитной индукции (точнее, рекурсии) мы избавимся от требования конечномерности.


Пусть дано произвольное векторное пространство.
Говорят, что множество (возможно, бесконечное) векторов ${i`линейно независимо`}, если никакая нетривиальная линейная комбинация конечного числа векторов из этого множества не равна нулю.
(Заметим в скобках, что говорить о бесконечных линейных комбинациях в принципе можно лишь если в пространстве определена сходимость, чего мы сейчас не предполагаем.)
Линейно независимое множество векторов называется ${i`базисом ${label.ref('name_hamel')`Гамеля`}`} (или просто ${i`базисом`}) данного пространства, если любой вектор представим в виде конечной линейной комбинации элементов этого множества.


Как и в конечной ситуации, максимальное линейно независимое множество (которое становится линейно зависимым при добавлении любого нового элемента) является, очевидно, базисом.


${theorem`Всякое линейно независимое множество векторов может быть расширено до базиса Гамеля.`}

${proof.start}
Пусть ${math`S`} — линейно независимое подмножество векторного пространства ${math`V`}.
Рассмотрим вполне упорядоченное множество ${math`I`} достаточно большой мощности (большей, чем мощность пространства ${math`V`}).
Определим функцию ${math`f`} из ${math`I`} в ${math`V`} с помощью трансфинитной рекурсии:


${i`
${math`f(i) =`} элемент пространства ${math`V`}, не выражающийся линейно через элементы ${math`S`} и значения ${math`f(j)`} при ${math`j < i`}.
`}


Заметим, что это рекурсивное правило оставляет ${math`f(i)`} неопределённым, если такого невыразимого элемента не существует.(Кроме того, можно отметить, что мы снова используем аксиому выбора.
Более подробно следовало бы сказать так: по аксиоме выбора существует некоторая функция, которая по каждому подмножеству пространства ${math`V`}, через которое не всё ${math`V`} выражается, указывает один из невыразимых элементов.
Затем эта функция используется в рекурсивном определении.
Впрочем, аксиома выбора и так уже использована для доказательства ${label.ref('theorem_set-order')`теоремы Цермело`}.)


Это определение гарантирует, что ${math`f`} является инъекцией;
более того можно утверждать, что все значения ${math`f`} вместе с множеством ${math`S`} образуют линейно независимое множество.
В самом деле, пусть линейная комбинация некоторых значений функции ${math`f`} и элементов множества ${math`S`} равна нулю.
Можно считать, что все коэффициенты в этой комбинации отличны от нуля (отбросив нулевые слагаемые).
Входящие в комбинацию значения функции ${math`f`} имеют вид ${math`f(i)`} при различных ${math`i`}.
Посмотрим на тот из них, который имеет наибольшее ${math`i`};
по построению он должен быть линейно независим от остальных — противоречие.


Поскольку мы предположили, что множество ${math`I`} имеет большую мощность, чем ${math`V`}, рекурсивное определение задаёт функцию не на всём ${math`I`}, а только на некотором начальном отрезке ${math`[0, i)`}, а в точке ${math`i`} рекурсивное правило не определено (${label.ref('theorem_recursive-rule')`теорема ${n.theorem('recursive-rule')}`}).
Это означает, что все векторы пространства ${math`V`} выражаются через элементы множества ${math`S`} и значения функции ${math`f`} на промежутке ${math`[0, i)`}.
Кроме того, как мы видели, все эти векторы независимы.
Таким образом, искомый базис найден.
${proof.end}

${area.key('basis-construct')`
На самом деле можно обойтись без множества большей мощности, упорядочив само пространство ${math`V`}.
При этом на каждом шаге рекурсии надо либо добавлять очередной элемент к будущему базису (если он не выражается через предыдущие), либо оставлять базис без изменений.


${problem.key('basis-construct')`Проведите это рассуждение подробно.`}
`}


Базис Гамеля может быть использован для построения разных экзотических примеров.
Вот некоторые из них:


${theorem.key('linear-func')`Существует (всюду определённая) функция ${math`f: \\R \\to \\R`}, для которой ${math`f(x + y) = f(x) + f(y)`} при всех ${math`x`} и ${math`y`}, но которая не есть умножение на константу.`}


${proof.start}
Рассмотрим ${math`\\R`} как векторное пространство над полем ${math`\\Bbb{Q}`}.
В нём есть базис Гамеля.
Пусть ${math`\\alpha`} — один из векторов базиса.
Рассмотрим функцию ${math`f`}, которая с каждым числом ${math`x`}
(рассматриваемым как вектор в пространстве ${math`\\R`} над полем ${math`\\Bbb{Q}`})
сопоставляет его ${math`\\alpha`}-координату
(коэффициент при ${math`\\alpha`} в единственном выражении ${math`x`} через векторы базиса).
Эта функция линейна над ${math`\\Bbb{Q}`}, поэтому ${math`f(x + y) = f(x) + f(y)`} для всех ${math`x, y \\in \\R`}.
Она отлична от нуля (${math`f(\\alpha) = 1`}) и принимает лишь рациональные значения, поэтому не может быть умножением на константу.
${proof.end}


${problem`Покажите, что всякая функция, обладающая указанными в ${label.ref('theorem_linear-func')`теореме ${n.theorem('linear-func')}`} свойствами, не ограничена ни на каком отрезке и, более того, её график всюду плотен в ${math`\\R^2`}.`}


${theorem`Аддитивные группы ${math`\\R`} и ${math`\\R \\oplus \\R`} изоморфны.`}


${proof.start}
Рассмотрим ${math`\\R`} как векторное пространство над ${math`\\Bbb{Q}`} и выберем базис в этом пространстве.
Очевидно, он бесконечен.
Базис в ${math`\\R \\oplus \\R`} может быть составлен из двух частей, каждая из которых представляет собой базис в одном из экземпляров ${math`\\R`}.
Как мы увидим чуть позже (см. раздел ${link.ref('paragraph_cardinal-rules')`${n.paragraph('cardinal-rules')}`}), для любого бесконечного множества ${B} удвоенная мощность ${B}
(мощность объединения двух непересекающихся множеств, равномощных ${B}) равна мощности ${B}.
Наконец, осталось заметить, что пространства над одним и тем же полем с равномощными базисами изоморфны как векторные пространства и тем более как группы.
${proof.end}


${problem`
Докажите, что любой базис в пространстве ${math`\\R`} над полем ${math`\\Bbb{Q}`} имеет мощность континуума.
(При доказательстве пригодятся результаты раздела ${link.ref('paragraph_cardinal-rules')`${n.paragraph('cardinal-rules')}`}.)
`}


Мы видели, что трансфинитная индукция позволяет доказать существование базиса в любом векторном пространстве.
Продолжая эту линию, можно доказать, что любые два базиса векторного пространства равномощны.
(Таким образом, понятие размерности как мощности базиса корректно определено и для бесконечномерных векторных пространств.)
Мы вернёмся к этому позже(${label.ref('theorem_inf-basis')`теорема ${n.theorem('inf-basis')}`}).


Отметим, что существование базиса Гамеля можно использовать и «в мирных целях», а не только для построения экзотических примеров.
Известная «третья проблема ${label.ref('name_hilbert')`Гильберта`}» состояла в доказательстве того, что многогранники равного объёма могут не быть равносоставлены.
(Это значит, что один из них нельзя разрезать на меньшие многогранники и сложить из них другой многогранник.)
Для многоугольников на плоскости ситуация иная: если два многоугольника равновелики (имеют равную площадь), то они равносоставлены.


${theorem`Куб нельзя разрезать на многогранные части, из которых можно было бы составить правильный тетраэдр.`}


${proof.start}
Введём понятие ${i`псевдообъёма`} многогранника.
Как и объём, псевдообъём будет аддитивен
(если многогранник разбит на части, сумма их псевдообъёмов равна псевдообъёму исходного многогранника);
псевдообъёмы равных многогранников будут равны.
Отсюда следует, что псевдообъёмы равносоставленных многогранников будут равны.
Мы подберём псевдообъём так, чтобы у куба он равнялся нулю, а у тетраэдра нет — и доказательство будет завершено.


Псевдообъём многогранника мы определим как сумму ${math`\\sum l_i \\varphi(\\alpha_i)`}, где сумма берётся по всем рёбрам многогранника, ${math`l_i`} — длина ${math`i`}-го ребра, ${math`\\alpha_i`} — двугранный угол при этом ребре, а ${math`\\varphi`} — некоторая функция.
Такое определение автоматически гарантирует, что равные многогранники имеют равные псевдообъёмы.
Что нужно от функции ${math`\\varphi`}, чтобы псевдообъём был аддитивен?
Представим себе, что многогранник разрезается плоскостью на две части, и плоскость проходит через уже имеющееся ребро длины ${math`l`}.
Тогда двугранный угол ${math`\\alpha`} при этом ребре разбивается на две части ${math`\\beta`} и ${math`\\gamma`}.
Поэтому в выражении для псевдообъёма вместо слагаемого ${math`l \\varphi(\\alpha)`} появляются слагаемые ${math`l \\varphi(\\beta) + l \\varphi(\\gamma)`}, и ${math`\\varphi(\\alpha)`} должно равняться ${math`\\varphi(\\beta) + \\varphi(\\gamma)`}.
Кроме того, разрезающая плоскость может образовать новое ребро, пересекшись с какой-то гранью.
Обозначим длину этого ребра за ${math`l'`}.
Тогда в псевдообъёме появятся слагаемые ${math`l' \\varphi(\\alpha) + l' \\varphi(\\pi - \\alpha)`}
(два образовавшихся двугранных угла дополнительны), которые в сумме должны равняться нулю.


Теперь ясно, какими свойствами должна обладать функция ${math`\\varphi`}.
Нужно, чтобы ${math`\\varphi(\\beta + \\gamma) = \\varphi(\\beta) + \\varphi(\\gamma)`} и чтобы ${math`\\varphi(\\pi) = 0`}.
Тогда псевдообъём будет и впрямь аддитивен.
Аккуратная проверка требует точного определения понятия многогранника (что не так и просто), и мы её проводить не будем.
Наглядно аддитивность кажется очевидной, особенно если учесть, что все разрезы можно проводить плоскостями
(при этом могут получиться более мелкие части, но это не страшно).


Итак, для завершения рассуждения достаточно построить функцию ${math`\\varphi: \\R \\to \\R`}, для которой
${start(list)}
${item`
${math`\\varphi(\\beta + \\gamma) = \\varphi(\\beta) + \\varphi(\\gamma)`} для всех ${math`\\beta, \\gamma \\in \\R`};
`}
${item`
${math`\\varphi(\\pi) = 0`} (это свойство вместе с предыдущим гарантирует аддитивность псевдообъёма);
`}
${item`
${math`\\varphi(\\pi / 2) = 0`} (псевдообъём куба равен нулю; это свойство, впрочем, легко следует из двух предыдущих);
`}
${item`
${math`\\varphi(\\theta) \\not = 0`}, где ${math`\\theta`} — двугранный угол при ребре правильного тетраэдра.
`}
${end(list)}

Существенно здесь то, что отношение ${math`\\theta / \\pi`} иррационально.
Проверим это.
Высоты двух соседних граней, опущенные на общее ребро, образуют равнобедренный треугольник со сторонами ${math`\\sqrt{3}, \\sqrt{3}, 2`};
надо доказать, что углы этого треугольника несоизмеримы с ${math`\\pi`}.
Удобнее рассмотреть не ${math`\\theta`}, а другой угол треугольника (два других угла треугольника равны); обозначим его ${math`\\beta`}.
Это угол прямоугольного треугольника со сторонами ${math`1, \\sqrt{2}`} и ${math`\\sqrt{3}`}, так что
${math.block()`
(\\cos \\beta + i \\sin \\beta) = (1 + \\sqrt{-2}) / \\sqrt{3}.
`}
Если бы угол ${math`\\theta`} был соизмерим с ${math`\\pi`}, то и ${math`\\beta`} был бы соизмерим, поэтому некоторая степень этого комплексного числа равнялась бы единице.
Можно проверить, однако, что это не так, поскольку кольцо чисел вида ${math`m + n \\sqrt{-2} (m, n \\in Z)`} евклидово и разложение на множители в нём однозначно.


Дальнейшее просто: рассмотрим числа ${math`\\pi`} и ${math`\\theta`}.
Они независимы как элементы векторного пространства ${math`\\R`} над ${math`\\Bbb{Q}`}, дополним их до базиса и рассмотрим ${math`\\Bbb{Q}`}-линейный функционал ${math`\\varphi: \\R \\to \\Bbb{Q}`}, равный коэффициенту при ${math`\\theta`} в разложении по этому базису.
Очевидно, все требования при этом будут выполнены.
${proof.end}


${problem`
Покажите, что некоторое усложнение этого рассуждения позволяет обойтись без базиса Гамеля: достаточно определять ${math`\\varphi`} не на всех действительных числах, а только на линейных комбинациях углов, встречающихся при разрезании куба и тетраэдра на части.
`}


В качестве отступления приведём ещё два странных примера, возникающих благодаря аксиоме выбора
(в них даже трансфинитная индукция не используется).


${b`Разноцветные шляпы`}. Представим себе сначала шеренгу из ста человек в чёрных и белых шляпах.
Каждый видит цвета шляп стоящих перед ним, но не видит своей шляпы и шляп позади стоящих, и должен отгадать цвет своей шляпы.
Могут ли участники игры договориться заранее, как они должны действовать, чтобы с гарантией большинство догадок было правильными?
(Игроки не произносят вслух свои догадки, так что другие игроки не могут их учитывать.)


Легко понять, что стоящая перед игроками задача неразрешима.
Стоящий первым в шеренге не видит никого, так что его догадка ни от чего не зависит и заранее предопределена.
Наденем ему шляпу другого цвета и сделаем его догадку ошибочной
Цвет шляпы первого определяет догадку второго (у которого нет иной информации), и ему тоже можно надеть шляпу другого цвета.
После этого определится догадка третьего, и так далее.
Таким образом, для любой стратегии действий игроков есть вариант, в котором все ошибутся.


Ситуация удивительным образом меняется, если игроки стоят в бесконечной шеренге, у которой есть последний, но нет первого, и каждый из игроков видит шляпы впереди стоящих.
Другими словами, игроки стоят в точках ${math`0, 1, 2, \\dots`} числовой прямой, глядя вправо, и игрок в точке ${math`i`} знает свою координату и цвета шляп всех следующих игроков (${math`i + 1, i + 2, \\dots`}).
Его стратегия, таким образом, является функцией, аргумент которой — последовательность цветов видимых им шляп, а значением — догадка о цвете собственной шляпы.


Как ни странно, существуют стратегии игроков, при которых с гарантией все догадки, кроме конечного числа, будут правильными.
Чтобы доказать существование таких стратегий, будем называть «раскраской» последовательность цветов шляп всех игроков.
Две раскраски будем называть эквивалентными, если они различаются лишь в конечном числе точек (для конечного числа игроков).
Выберем в каждом классе эквивалентности по одной «канонической» раскраске.
Каждый игрок должен действовать так: видя всех игроков перед собой, он может определить класс эквивалентности раскраски
(так как изменение конечного числа остальных игроков, включая его самого´, не меняет этого класса).
Затем в качестве догадки он указывает цвет своей шляпы в каноническом представителе этого класса эквивалентности.


Какова бы ни была реальная раскраска, она отличается от эквивалентной ей канонической раскраски лишь в конечном числе мест (по определению эквивалентности).
Поэтому все игроки, стоящие дальше этих мест, угадают правильно — у них самих тот же цвет, и видят они то же самое, что в канонической раскраске.


${problem`
Покажите, что игроки могут добиться того же результата (гарантировать конечное число неверных догадок) и в более сложной ситуации, когда они не знают своего положения.
(Полезно отдельно рассмотреть классы, содержащие периодические раскраски.)
`}


${b`Неизмеримое множество`}. Будем считать две точки окружности эквивалентными, если дуга между ними составляет рациональную часть окружности (${math`=`} измеряется рациональным числом градусов).
Это действительно отношение эквивалентности, так как сумма двух рациональных чисел рациональна (транзитивность).
Выберем в каждом классе эквивалентности по одной точке;
полученное множество «представителей» обозначим ${math`M`}.


Если повернуть множество ${math`M`} на рациональный (в градусах, то есть соизмеримый с окружностью) угол ${math`\\alpha`}, то повёрнутое множество ${math`M_{\\alpha}`} не будет пересекаться с исходным: пересечение означало бы, что есть два представителя, отличающихся на ${math`\\alpha`}, то есть лежащих в одном и том же классе.


С другой стороны, в объединении множества ${math`M_{\\alpha}`} (при всех рациональных углах поворота ${math`\\alpha`}) дают всю окружность (каждая точка имеет представителя в своём классе, и поворот ${math`M`} на соответствующий угол покроет её).


Получается, что окружность разбита на счётное число конгруэнтных (совмещающихся поворотом) множеств.
Какую же долю окружности (по мере) составляет каждое множество?
Поскольку множества конгруэнтны, то эти доли равны;
поскольку они все помещаются в окружности без пересечений, то доля не может быть положительной, то есть равна нулю.


Как ни странно, в объединении счётное число таких «нулевых» множеств составляет всю окружность.
(Говоря более формально, не существует ненулевой счётно-аддитивной меры, определённой на всех подмножествах окружности и инвариантной относительно поворотов.)


Ещё удивительнее пространственный вариант этого примера: можно разбить шар на конечное число непересекающихся множеств, из которых (сдвинув каждую часть в пространстве) можно получить два шара того же размера.
Этот пример называют «парадоксом ${label.ref('name_banach')`Банаха`}—${label.ref('name_tarski')`Тарского`}».
Но это построение сложнее и требует знакомства с алгеброй
(в одном из вариантов используется свободная подгруппа с двумя образующими в группе ${math`SO(3)`}).
`;
};
